STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Demonstrations/DemoUCPD/Src/usbpd_vdm_user.c
        if (USBPD_PORT_1 == PortNum)
        {
          MUX_TypeCConnectorPinAssignmentTypeDef assignement = UFP_PIN_ASSIGNMMENT_A;
          switch(vdo.d.UFP_U_Pin)
          {
          case DP_PIN_ASSIGNMENT_NONE:         /*!< De-select pin assignment.  */
            assignement = USB_ONLY_PIN_ASSIGNMMENT;
            break;
          case DP_PIN_ASSIGNMENT_A:            /*!< Select Pin Assignment A    */
            assignement = UFP_PIN_ASSIGNMMENT_A;
            break;
          case DP_PIN_ASSIGNMENT_B:            /*!< Select Pin Assignment B    */
            assignement = UFP_PIN_ASSIGNMMENT_B;
            break;
          case DP_PIN_ASSIGNMENT_C:            /*!< Select Pin Assignment C    */
            assignement = UFP_PIN_ASSIGNMMENT_C;
            break;
          case DP_PIN_ASSIGNMENT_D:            /*!< Select Pin Assignment D    */
            assignement = UFP_PIN_ASSIGNMMENT_D;
            break;
          case DP_PIN_ASSIGNMENT_E:            /*!< Select Pin Assignment E    */
            assignement = UFP_PIN_ASSIGNMMENT_E;
            break;
          case DP_PIN_ASSIGNMENT_F:            /*!< Select Pin Assignment F    */
            assignement = UFP_PIN_ASSIGNMMENT_F;
            break;
          default :
            status = USBPD_NAK;
            break;
          }
          if (CC1 == DPM_Params[USBPD_PORT_1].ActiveCCIs)
            BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_NORMAL, assignement);
          else
            BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_FLIPPED, assignement);
        }
        *pVDO = 0;
        *pNbData = 0;
      }
      break;

    default :
      status = USBPD_NAK;
      break;
    }
  }
  return status;
}

/**
  * @brief  VDM Inform Specific callback
  * @param  PortNum    current port number
  * @param  VDMCommand VDM command based on @ref USBPD_VDM_Command_Typedef
  * @param  NbData     Pointer of number of received VDO
  * @param  VDO        Pointer of received VDO
  * @retval status
  */
static void USBPD_VDM_InformSpecific(uint8_t PortNum, USBPD_VDM_Command_Typedef VDMCommand, uint8_t *NbData, uint32_t *VDO)
{
  if (USBPD_PORTDATAROLE_DFP == DPM_Params[PortNum].PE_DataRole)
  {
    switch(VDMCommand)
    {
    case SVDM_DP_STATUS :
      {
        USBPD_DPStatus_TypeDef vdo_received;
        vdo_received.d32 = VDO[0];
        /* SEND SVDM_DP_CONFIG only if Port is connected */
        if (MODE_DP_STATUS_CONNECT_NO != vdo_received.d.ConnectStatus)
        {
          USBPD_PE_SVDM_RequestSpecific(PortNum, USBPD_SOPTYPE_SOP, SVDM_DP_CONFIG, DISPLAY_PORT_SVID);
        }
     }
      break;
    case SVDM_DP_CONFIG :
      if (MUX_OK != BSP_MUX_SetHPDState(TYPE_C_MUX_1, HPD_STATE_HIGH))
      {
        return;
      }

      if (CC1 == DPM_Params[USBPD_PORT_0].ActiveCCIs)
        BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_1, PLUG_ORIENTATION_NORMAL, DFP_PIN_ASSIGNMMENT_C);
      else
        BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_1, PLUG_ORIENTATION_FLIPPED, DFP_PIN_ASSIGNMMENT_C);
      break;

    default :
      return;
    }
  }
  else
  {
    switch(VDMCommand)
    {
    case SVDM_DP_STATUS :
      {
        USBPD_DPStatus_TypeDef vdo_received;

        vdo_received.d32 = VDO[0];

        if (vdo_received.d.ConnectStatus != MODE_DP_STATUS_CONNECT_NO)
        {
          sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_UFP_D;
        }
        else
        {
          /* DP not connected */
          sDP_Status[PortNum].d.ConnectStatus = MODE_DP_STATUS_CONNECT_NO;
        }
      }
      break;
    case SVDM_DP_CONFIG :
      break;

    default :
      break;
    }
  }
}

/**
  * @brief  Initialize HPD Alert pin
  * @param  PortNum    current port number
  * @retval USBPD status
  */
static USBPD_StatusTypeDef HPD_Init(uint8_t PortNum)
{
  MUX_HPDStateTypeDef hpd_state;
  if (MUX_OK != BSP_MUX_Init(TYPE_C_MUX_2))
  {
    return USBPD_ERROR;
  }

  if (MUX_OK != BSP_MUX_Init(TYPE_C_MUX_1))
  {
    return USBPD_ERROR;
  }

  /* Register HPD callback function */
  if (BSP_MUX_RegisterHPDCallbackFunc(TYPE_C_MUX_2, USBPD_VDM_UserCallback) != MUX_OK)
  {
    return USBPD_ERROR;
  }

  if (MUX_OK != BSP_MUX_GetHPDState(TYPE_C_MUX_2, &hpd_state))
  {
    return USBPD_ERROR;
  }

  if (HPD_STATE_HIGH == hpd_state)
  {
    sDP_Status[PortNum].d.HPDState = 1;
    sDP_Status[PortNum].d.Enable = 1;
  }
  else
  {
    sDP_Status[PortNum].d.HPDState = 0;
    sDP_Status[PortNum].d.Enable = 0;
  }

  return USBPD_OK;
}

static void USBPD_VDM_UserCallback(MUX_TypeCMuxIdTypeDef TypeCMuxId,
                            MUX_HPDStateTypeDef   HPDState)
{
  if (HPD_STATE_HIGH == HPDState)
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_HIGH_PORT1);
    sDP_Status[USBPD_PORT_1].d.HPDState = 1;
    sDP_Status[USBPD_PORT_1].d.Enable = 1;
  }
  else
  {
    DEMO_PostMMIMessage(DEMO_MMI_ACTION_HPD_DETECT_LOW_PORT1);
    sDP_Status[USBPD_PORT_1].d.HPDState = 0;
    sDP_Status[USBPD_PORT_1].d.Enable = 1;
  }

  /* Send attention message only if USBPD_PORT_1 is connected*/
  if (USBPD_POWER_EXPLICITCONTRACT == DPM_Params[USBPD_PORT_1].PE_Power)
  {
    USBPD_PE_SVDM_RequestAttention(USBPD_PORT_1, USBPD_SOPTYPE_SOP, DISPLAY_PORT_SVID);
  }
}

/* Exported functions ---------------------------------------------------------*/
/**
  * @brief  VDM Initialization function
  * @param  PortNum     Index of current used port
  * @param  pSettings   Pointer on @ref USBPD_VDM_SettingsTypeDef structure
  * @param  pParams     Pointer on @ref USBPD_ParamsTypeDef structure
  * @retval status
  */
USBPD_StatusTypeDef USBPD_VDM_UserInit(uint8_t PortNum)
{
  uint32_t index = 0;

   /* Initialize SVID supported by consumer */
  SVIDInfo[PortNum].NumSVIDs = MAX_SVID_USER;

  for (index = 0; index < MAX_SVID_USER; index++)
  {
    SVIDInfo[PortNum].SVIDs[index] = DISPLAY_PORT_SVID + index;
  }

  USBPD_PE_InitVDM_Callback(PortNum, (USBPD_VDM_Callbacks *)&vdmCallbacks);


  if (USBPD_PORT_1 == PortNum)
    return HPD_Init(PortNum);
  else
    return USBPD_OK;
}

/**
  * @brief  VDM Reset function
  * @retval status
  */
void USBPD_VDM_UserReset(uint8_t PortNum)
{
  /* Reset Port Partner variables*/
  Remote_CurrentSVID[PortNum]       = 0;
  if (USBPD_PORT_1 == PortNum)
  {
    if (USBPD_TRUE == DPM_Params[USBPD_PORT_1].PE_IsConnected)
    {
      BSP_MUX_SetEQGain(TYPE_C_MUX_2, MUX_2_EQGAIN_MAX);
      BSP_MUX_Enable(TYPE_C_MUX_2);
    }
    else
    {
      BSP_MUX_SetDPPinAssignment(TYPE_C_MUX_2, PLUG_ORIENTATION_FLIPPED, USB_ONLY_PIN_ASSIGNMMENT);
    }
  }

  /* Disconnect received on Type-C */
  VDM_Mode_On[PortNum] = 0;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

